plplplplplpl1/stm32-mpu6050-3d-cube/User/main.c
										if (btn) {
											btnHold++;
											if (raw != 0) {
												if (autoDir == 0) {
													if (raw > 0) autoDir =  1;
													if (raw < 0) autoDir = -1;
													speedMul = 1;
												} else {
													if ((raw > 0 && autoDir > 0) || (raw < 0 && autoDir < 0))
														speedMul <<= 1;
													else {
														speedMul >>= 1;
														if (speedMul == 0) { autoDir = 0; speedMul = 1; }
													}
												}
												btnHold = 0;
											}
											if (btnHold >= 80)
												break;
										} else {
											btnHold = 0;
											if (raw != 0) {
												t0 += (float)raw * 0.05f;
												autoDir = 0;
												speedMul = 1;
											}
										}

										if (autoDir != 0)
											t0 += (float)autoDir * 0.15f * (float)speedMul;
									}

									Delay_ms(10);
								}
										}

								else if (curTrig == 1)  /* y=cos(t) */
								{
									float t0 = 0.0f;
									int16_t x;
									float tVal, yVal;
									int16_t px, py;
									uint16_t btnHold = 0;
									int8_t autoDir = 0;
									uint16_t speedMul = 1;

									while (1)
									{
										OLED_ClearBuffer();
										OLED_DrawLine(32, 0, 32, 63, 1);
										OLED_DrawLine(31, 5, 32,  0, 1);
										OLED_DrawLine(33, 5, 32,  0, 1);
										OLED_DrawLine( 0,32,127, 32, 1);
										OLED_DrawLine(122,31,127, 32, 1);
										OLED_DrawLine(122,33,127, 32, 1);
										{
											int16_t lx = 0, ly;
											tVal = t0 + (float)(lx - 32) / 14.0f;
											ly = 32 - (int16_t)(cosf(tVal) * 20.0f);
											for (x = 1; x < 128; x++)
											{
												tVal = t0 + (float)(x - 32) / 14.0f;
												py = 32 - (int16_t)(cosf(tVal) * 20.0f);
												OLED_DrawLine(lx, ly, x, py, 1);
												lx = x; ly = py;
											}
										}
										OLED_ShowCharBuf(1, 4, 'y');
										OLED_ShowCharBuf(3, 15, 't');
										OLED_Refresh();

										{
											int8_t raw = Key_GetEncRaw();
											uint8_t btn = (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_7) == 0);

											if (btn) {
												btnHold++;
												if (raw != 0) {
													if (autoDir == 0) {
														if (raw > 0) autoDir =  1;
														if (raw < 0) autoDir = -1;
														speedMul = 1;
													} else {
														if ((raw > 0 && autoDir > 0) || (raw < 0 && autoDir < 0))
															speedMul <<= 1;
														else {
															speedMul >>= 1;
															if (speedMul == 0) { autoDir = 0; speedMul = 1; }
														}
													}
													btnHold = 0;
												}
												if (btnHold >= 80)
													break;
											} else {
												btnHold = 0;
												if (raw != 0) {
													t0 += (float)raw * 0.05f;
													autoDir = 0;
													speedMul = 1;
												}
											}

											if (autoDir != 0)
												t0 += (float)autoDir * 0.15f * (float)speedMul;
										}

										Delay_ms(10);
									}
								}

										else if (curTrig == 2)  /* y=tan(t) */
								{
									float t0 = 0.0f;
									int16_t x;
									float tVal, yVal;
									int16_t px, py;
									uint16_t btnHold = 0;
									int8_t autoDir = 0;
									uint16_t speedMul = 1;

									while (1)
									{
										OLED_ClearBuffer();
										OLED_DrawLine(32, 0, 32, 63, 1);
										OLED_DrawLine(31, 5, 32,  0, 1);
										OLED_DrawLine(33, 5, 32,  0, 1);
										OLED_DrawLine( 0,32,127, 32, 1);
										OLED_DrawLine(122,31,127, 32, 1);
										OLED_DrawLine(122,33,127, 32, 1);

										{
											int16_t lx = 0, ly;
											tVal = t0 + (float)(lx - 32) / 14.0f;
											yVal = tanf(tVal);
											if (yVal > 100.0f) yVal = 100.0f;
											if (yVal < -100.0f) yVal = -100.0f;
											ly = 32 - (int16_t)(yVal * 20.0f);
											for (x = 1; x < 128; x++)
											{
												tVal = t0 + (float)(x - 32) / 14.0f;
												yVal = tanf(tVal);
												if (yVal > 100.0f) yVal = 100.0f;
												if (yVal < -100.0f) yVal = -100.0f;
												py = 32 - (int16_t)(yVal * 20.0f);
												{ int16_t d = ly - py; if (d < 0) d = -d;
												if (d < 40) OLED_DrawLine(lx, ly, x, py, 1); }
												lx = x; ly = py;
											}
										}
										OLED_ShowCharBuf(1, 4, 'y');
										OLED_ShowCharBuf(3, 15, 't');
										OLED_Refresh();

										{
											int8_t raw = Key_GetEncRaw();
											uint8_t btn = (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_7) == 0);

											if (btn) {
												btnHold++;
												if (raw != 0) {
													if (autoDir == 0) {
														if (raw > 0) autoDir =  1;
														if (raw < 0) autoDir = -1;
														speedMul = 1;
													} else {
														if ((raw > 0 && autoDir > 0) || (raw < 0 && autoDir < 0))
															speedMul <<= 1;
														else {
															speedMul >>= 1;
															if (speedMul == 0) { autoDir = 0; speedMul = 1; }
														}
													}
													btnHold = 0;
												}
												if (btnHold >= 80)
													break;
											} else {
												btnHold = 0;
												if (raw != 0) {
													t0 += (float)raw * 0.05f;
													autoDir = 0;
													speedMul = 1;
												}
											}

											if (autoDir != 0)
												t0 += (float)autoDir * 0.15f * (float)speedMul;
										}

										Delay_ms(10);
									}
								}
						else  /* curTrig == 3: y=csc(t) */
						{
							float t0 = 0.0f;
							int16_t x;
							float tVal, yVal;
							int16_t px, py;
							uint16_t btnHold = 0;
							int8_t autoDir = 0;
							uint16_t speedMul = 1;

							while (1)
							{
								OLED_ClearBuffer();
								OLED_DrawLine(32, 0, 32, 63, 1);
								OLED_DrawLine(31, 5, 32,  0, 1);
								OLED_DrawLine(33, 5, 32,  0, 1);
								OLED_DrawLine( 0,32,127, 32, 1);
								OLED_DrawLine(122,31,127, 32, 1);
								OLED_DrawLine(122,33,127, 32, 1);

								{
									int16_t lx = 0, ly;
									tVal = t0 + (float)(lx - 32) / 14.0f;
									yVal = 1.0f / sinf(tVal);
									if (yVal > 100.0f) yVal = 100.0f;
									if (yVal < -100.0f) yVal = -100.0f;
									ly = 32 - (int16_t)(yVal * 20.0f);
									for (x = 1; x < 128; x++)
									{
										tVal = t0 + (float)(x - 32) / 14.0f;
										yVal = 1.0f / sinf(tVal);
										if (yVal > 100.0f) yVal = 100.0f;
										if (yVal < -100.0f) yVal = -100.0f;
										py = 32 - (int16_t)(yVal * 20.0f);
										{ int16_t d = ly - py; if (d < 0) d = -d;
										if (d < 40) OLED_DrawLine(lx, ly, x, py, 1); }
										lx = x; ly = py;
									}
								}
								OLED_ShowCharBuf(1, 4, 'y');
								OLED_ShowCharBuf(3, 15, 't');
								OLED_Refresh();

								{
									int8_t raw = Key_GetEncRaw();
									uint8_t btn = (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_7) == 0);

