plplplplplpl1/stm32-mpu6050-3d-cube/User/main.c
									if (btn) {
										btnHold++;
										if (raw != 0) {
											if (autoDir == 0) {
												if (raw > 0) autoDir =  1;
												if (raw < 0) autoDir = -1;
												speedMul = 1;
											} else {
												if ((raw > 0 && autoDir > 0) || (raw < 0 && autoDir < 0))
													speedMul <<= 1;
												else {
													speedMul >>= 1;
													if (speedMul == 0) { autoDir = 0; speedMul = 1; }
												}
											}
											btnHold = 0;
										}
										if (btnHold >= 80) break;
									} else {
										btnHold = 0;
										if (raw != 0) {
											t0 += (float)raw * 0.05f;
											autoDir = 0;
											speedMul = 1;
										}
									}

									if (autoDir != 0)
										t0 += (float)autoDir * 0.15f * (float)speedMul;
								}

								Delay_ms(10);
							}
						}
									while (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_7) == 0);
									Delay_ms(100);
									OLED_Clear();
									OLED_ShowString(1, 1, curTrig == 0 ? ">" : " ");
									OLED_ShowString(1, 2, "1 y=sin(t)");
									OLED_ShowString(2, 1, curTrig == 1 ? ">" : " ");
									OLED_ShowString(2, 2, "2 y=cos(t)");
									OLED_ShowString(3, 1, curTrig == 2 ? ">" : " ");
									OLED_ShowString(3, 2, "3 y=tan(t)");
									OLED_ShowString(4, 1, curTrig == 3 ? ">" : " ");
									OLED_ShowString(4, 2, "4 y=csc(t)");
								}
								Delay_ms(10);
							}
							}
						else if (cur2d == 1)  /* 反三角 */
							{
								uint8_t curArc = 0;

								OLED_Clear();
								OLED_ShowString(2, 1, ">");
								OLED_ShowString(2, 2, "1 y=arcsin(t)");
								OLED_ShowString(3, 1, " ");
								OLED_ShowString(3, 2, "2 y=arccos(t)");
								OLED_ShowString(4, 1, " ");
								OLED_ShowString(4, 2, "3 y=arctan(t)");

								while (1)
								{
									keyNum = Key_GetNum();
									if (keyNum == 2) break;
									if (keyNum == 4) { curArc++; if (curArc >= 3) curArc = 0; }
									if (keyNum == 3) { curArc--; if (curArc <  0) curArc = 2; }
									{
										OLED_ShowString(2, 1, curArc == 0 ? ">" : " ");
										OLED_ShowString(3, 1, curArc == 1 ? ">" : " ");
										OLED_ShowString(4, 1, curArc == 2 ? ">" : " ");
									}
									if (keyNum == 1)
									{
										float t0 = 0.0f;
										int16_t x;
										int16_t px, py;
										uint16_t btnHold = 0;
										int8_t autoDir = 0;
										uint16_t speedMul = 1;

										while (1)
										{
											OLED_ClearBuffer();
											OLED_DrawLine(32, 0, 32, 63, 1);
											OLED_DrawLine(31, 5, 32,  0, 1);
											OLED_DrawLine(33, 5, 32,  0, 1);
											OLED_DrawLine( 0,32,127, 32, 1);
											OLED_DrawLine(122,31,127, 32, 1);
											OLED_DrawLine(122,33,127, 32, 1);

											{
												int16_t lx = 0, ly, first = 1;
												for (x = 0; x < 128; x++)
												{
													/* arcsin/arccos 定义域窄，用大 scale 撑满屏幕；arctan 保持原比例 */
								float xs = (curArc == 2) ? 14.0f : 32.0f;
								int16_t cx = (curArc == 2) ? 32 : 64;
								float tVal = t0 + (float)(x - cx) / xs;
													float yVal;

													if (curArc == 0)      yVal = asinf(tVal);
													else if (curArc == 1) yVal = acosf(tVal);
													else                  yVal = atanf(tVal);

													if (curArc != 2 && (tVal < -1.0f || tVal > 1.0f)) { first = 1; continue; }
													if (yVal > 100.0f) yVal = 100.0f;
													if (yVal < -100.0f) yVal = -100.0f;
													py = 32 - (int16_t)(yVal * 20.0f);
													if (first) { lx = x; ly = py; first = 0; continue; }
													{ int16_t d = ly - py; if (d < 0) d = -d;
													if (d < 40) OLED_DrawLine(lx, ly, x, py, 1); }
													lx = x; ly = py;
												}
											}
											OLED_ShowCharBuf(1, 4, 'y');
											OLED_ShowCharBuf(3, 15, 't');
											OLED_Refresh();

											{
												int8_t raw = Key_GetEncRaw();
												uint8_t btn = (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_7) == 0);

												if (btn) {
													btnHold++;
													if (raw != 0) {
														if (autoDir == 0) {
															if (raw > 0) autoDir =  1;
															if (raw < 0) autoDir = -1;
															speedMul = 1;
														} else {
															if ((raw > 0 && autoDir > 0) || (raw < 0 && autoDir < 0))
																speedMul <<= 1;
															else {
																speedMul >>= 1;
																if (speedMul == 0) { autoDir = 0; speedMul = 1; }
															}
														}
														btnHold = 0;
													}
													if (btnHold >= 80) break;
												} else {
													btnHold = 0;
													if (raw != 0) {
														t0 += (float)raw * ((curArc == 2) ? 0.05f : 0.02f);
														autoDir = 0;
														speedMul = 1;
													}
												}

												if (autoDir != 0)
													t0 += (float)autoDir * ((curArc == 2) ? 0.15f : 0.04f) * (float)speedMul;
											}

											Delay_ms(10);
										}

										while (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_7) == 0);
										Delay_ms(100);
										OLED_Clear();
										OLED_ShowString(2, 1, curArc == 0 ? ">" : " ");
										OLED_ShowString(2, 2, "1 y=arcsin(t)");
										OLED_ShowString(3, 1, curArc == 1 ? ">" : " ");
										OLED_ShowString(3, 2, "2 y=arccos(t)");
										OLED_ShowString(4, 1, curArc == 2 ? ">" : " ");
										OLED_ShowString(4, 2, "3 y=arctan(t)");
									}
									Delay_ms(10);
								}
							}

							else if (cur2d == 2)  /* 指数/对数 */
							{
								uint8_t curExp = 0;

								OLED_Clear();
								OLED_ShowString(2, 1, ">");
								OLED_ShowString(2, 2, "1 y=e^x");
								OLED_ShowString(3, 1, " ");
								OLED_ShowString(3, 2, "2 y=ln(x)");
								OLED_ShowString(4, 1, " ");
								OLED_ShowString(4, 2, "3 y=lg(x)");

								while (1)
								{
									keyNum = Key_GetNum();
									if (keyNum == 2) break;
									if (keyNum == 4) { curExp++; if (curExp >= 3) curExp = 0; }
									if (keyNum == 3) { curExp--; if (curExp <  0) curExp = 2; }
									{
										OLED_ShowString(2, 1, curExp == 0 ? ">" : " ");
										OLED_ShowString(3, 1, curExp == 1 ? ">" : " ");
										OLED_ShowString(4, 1, curExp == 2 ? ">" : " ");
									}
									if (keyNum == 1)
									{
										float t0 = 0.0f;
										int16_t x;
										int16_t px, py;
										uint16_t btnHold = 0;
										int8_t autoDir = 0;
										uint16_t speedMul = 1;

										while (1)
										{
											OLED_ClearBuffer();
											OLED_DrawLine(32, 0, 32, 63, 1);
											OLED_DrawLine(31, 5, 32,  0, 1);
											OLED_DrawLine(33, 5, 32,  0, 1);
											OLED_DrawLine( 0,32,127, 32, 1);
											OLED_DrawLine(122,31,127, 32, 1);
											OLED_DrawLine(122,33,127, 32, 1);

											{
												int16_t lx = 0, ly, first = 1;
												for (x = 0; x < 128; x++)
												{
													float tVal = t0 + (float)(x - 32) / 14.0f;
													float yVal;

													/* ln/lg 定义域 > 0 */
													if (curExp != 0 && tVal <= 0.0f) { first = 1; continue; }

