plplplplplpl1/stm32-mpu6050-3d-cube/User/main.c
													if (curExp == 0)      yVal = expf(tVal);
													else if (curExp == 1) yVal = logf(tVal);
													else                  yVal = log10f(tVal);

													if (yVal > 100.0f) yVal = 100.0f;
													if (yVal < -100.0f) yVal = -100.0f;
													py = 32 - (int16_t)(yVal * 20.0f);
													if (first) { lx = x; ly = py; first = 0; continue; }
													{ int16_t d = ly - py; if (d < 0) d = -d;
													if (d < 40) OLED_DrawLine(lx, ly, x, py, 1); }
													lx = x; ly = py;
												}
											}
											OLED_ShowCharBuf(1, 4, 'y');
											OLED_ShowCharBuf(3, 15, 't');
											OLED_Refresh();

											{
												int8_t raw = Key_GetEncRaw();
												uint8_t btn = (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_7) == 0);

												if (btn) {
													btnHold++;
													if (raw != 0) {
														if (autoDir == 0) {
															if (raw > 0) autoDir =  1;
															if (raw < 0) autoDir = -1;
															speedMul = 1;
														} else {
															if ((raw > 0 && autoDir > 0) || (raw < 0 && autoDir < 0))
																speedMul <<= 1;
															else {
																speedMul >>= 1;
																if (speedMul == 0) { autoDir = 0; speedMul = 1; }
															}
														}
														btnHold = 0;
													}
													if (btnHold >= 80) break;
												} else {
													btnHold = 0;
													if (raw != 0) {
														t0 += (float)raw * 0.05f;
														autoDir = 0;
														speedMul = 1;
													}
												}

												if (autoDir != 0)
													t0 += (float)autoDir * 0.15f * (float)speedMul;
											}

											Delay_ms(10);
										}

										while (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_7) == 0);
										Delay_ms(100);
										OLED_Clear();
										OLED_ShowString(2, 1, curExp == 0 ? ">" : " ");
										OLED_ShowString(2, 2, "1 y=e^x");
										OLED_ShowString(3, 1, curExp == 1 ? ">" : " ");
										OLED_ShowString(3, 2, "2 y=ln(x)");
										OLED_ShowString(4, 1, curExp == 2 ? ">" : " ");
										OLED_ShowString(4, 2, "3 y=lg(x)");
									}
									Delay_ms(10);
								}
							}
						else  /* cur2d == 3: POW */
						{
							uint8_t curPow = 0;

							OLED_Clear();
							OLED_ShowString(2, 1, ">");
							OLED_ShowString(2, 2, "1 y=x^2");
							OLED_ShowString(3, 1, " ");
							OLED_ShowString(3, 2, "2 y=sqrt(x)");
							OLED_ShowString(4, 1, " ");
							OLED_ShowString(4, 2, "3 y=1/x");  /* 等按键状态稳定 */
							while (1)
							{
								keyNum = Key_GetNum();
								if (keyNum == 2) break;
								if (keyNum == 4) { curPow++; if (curPow >= 3) curPow = 0; }
								if (keyNum == 3) { curPow--; if (curPow <  0) curPow = 2; }
								{
									OLED_ShowString(2, 1, curPow == 0 ? ">" : " ");
									OLED_ShowString(3, 1, curPow == 1 ? ">" : " ");
									OLED_ShowString(4, 1, curPow == 2 ? ">" : " ");
								}
								if (keyNum == 1)
								{
									float t0 = 0.0f;
									int16_t x, px, py;
									uint16_t btnHold = 0;
									int8_t autoDir = 0;
									uint16_t speedMul = 1;

									while (1)
									{
										OLED_ClearBuffer();
										OLED_DrawLine(32, 0, 32, 63, 1);
										OLED_DrawLine(31, 5, 32,  0, 1);
										OLED_DrawLine(33, 5, 32,  0, 1);
										OLED_DrawLine( 0,32,127, 32, 1);
										OLED_DrawLine(122,31,127, 32, 1);
										OLED_DrawLine(122,33,127, 32, 1);

										{
											int16_t lx = 0, ly, first = 1;
											for (x = 0; x < 128; x++)
											{
												float tVal = t0 + (float)(x - 32) / 14.0f;
												float yVal;

												if (curPow == 1 && tVal < 0.0f) { first = 1; continue; }
												if (curPow == 2 && tVal > -0.001f && tVal < 0.001f) { first = 1; continue; }

												if (curPow == 0)      yVal = tVal * tVal;
												else if (curPow == 1) yVal = sqrtf(tVal);
												else                  yVal = 1.0f / tVal;

												if (yVal > 100.0f) yVal = 100.0f;
												if (yVal < -100.0f) yVal = -100.0f;
												py = 32 - (int16_t)(yVal * 20.0f);
												if (first) { lx = x; ly = py; first = 0; continue; }
												{ int16_t d = ly - py; if (d < 0) d = -d;
												if (d < 40) OLED_DrawLine(lx, ly, x, py, 1); }
												lx = x; ly = py;
											}
										}
										OLED_ShowCharBuf(1, 4, 'y');
										OLED_ShowCharBuf(3, 15, 't');
										OLED_Refresh();

										{
											int8_t raw = Key_GetEncRaw();
											uint8_t btn = (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_7) == 0);

											if (btn) {
												btnHold++;
												if (raw != 0) {
													if (autoDir == 0) {
														if (raw > 0) autoDir =  1;
														if (raw < 0) autoDir = -1;
														speedMul = 1;
													} else {
														if ((raw > 0 && autoDir > 0) || (raw < 0 && autoDir < 0))
															speedMul <<= 1;
														else {
															speedMul >>= 1;
															if (speedMul == 0) { autoDir = 0; speedMul = 1; }
														}
													}
													btnHold = 0;
												}
												if (btnHold >= 80) break;
											} else {
												btnHold = 0;
												if (raw != 0) {
													t0 += (float)raw * 0.05f;
													autoDir = 0;
													speedMul = 1;
												}
											}

											if (autoDir != 0)
												t0 += (float)autoDir * 0.15f * (float)speedMul;
										}

										Delay_ms(10);
									}
									while (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_7) == 0);
									Delay_ms(100);
									OLED_Clear();
									OLED_ShowString(2, 1, curPow == 0 ? ">" : " ");
									OLED_ShowString(2, 2, "1 y=x^2");
									OLED_ShowString(3, 1, curPow == 1 ? ">" : " ");
									OLED_ShowString(3, 2, "2 y=sqrt(x)");
									OLED_ShowString(4, 1, curPow == 2 ? ">" : " ");
									OLED_ShowString(4, 2, "3 y=1/x");
								}
								Delay_ms(10);
							}
						}

									OLED_Clear();
									OLED_ShowString(1, 1, cur2d == 0 ? ">" : " ");
									OLED_ShowString(1, 2, "POW");
									OLED_ShowString(2, 1, cur2d == 1 ? ">" : " ");
									OLED_ShowChineseStr(2, 2, trig, 4);
									OLED_ShowString(3, 1, cur2d == 2 ? ">" : " ");
									OLED_ShowChineseStr(3, 2, invtrig, 3);
									OLED_ShowString(4, 1, cur2d == 3 ? ">" : " ");
									OLED_ShowChineseStr(4, 2, expn, 4);
						Delay_ms(10);
					}
					}
				}
				}  /* sub-menu while(1) */
			}
			else if (menuRet == 1)  /* 动画 */
		{
			Animation_Show();
		}
		else if (menuRet == 2)  /* OLED检测 */
		{
			uint8_t t = 0, k;
			OledTest(0);









			while(1){k=Key_GetNum();if(k==4){t=(t+1)%6;OledTest(t);}
			else if(k==3){t=(t==0)?5:t-1;OledTest(t);}
			else if(k==2){OLED_Clear();break;}Delay_ms(10);}
		}
		else if (menuRet == 3)  /* 雷达 */
		{
			Radar_Run();
		}
	}
}
